# 4. Задан глобальный список products, содержащий в себе словари с данными о таварах:
# id (id товара, уникальный) title (название) price(цена) discount (скидка, диапазон значение
# от 0 до 15), на вход функции поступает список кортежей с данными о таварах,
# купленных пользователем (каждый кортеж содержит id товара и количество данного
# товара). Необходимо выпустить кассовый чек (вернуть строку), в котором будут
# указаны названия товаров, их количество, общая стоимость и общая стоимость с
# учетом скидок